<template>
    <view class="container">
        <p>
            <span><b>倚民超市APP声明：</b></span>
        </p>
        <p>
            &nbsp;&nbsp;&nbsp;&nbsp; 我们注重对您个人隐私的保护。有时候我们需要某些信息才能为您提供您请求的服务，本隐私声明解释了这些情况下的数据收集和使用情况。本隐私声明适用于本网站的所有相关服务。如果您访问本APP、使用本APP的任何服务，那么您便接受了本隐私声明。
        </p>
        <p>用户信息的获取</p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;我们获取用户信息的主要目的在于向您提供一个顺畅、高效的购物流程，并致力于不断完善和提升您的购物体验。</p>
        <p>我们可能获取的用户信息类型包括：</p>
        <p>● 注册信息（如，用户名、及在注册过程中提供的其他信息）；</p>
        <p>● 个人联系方式（如，姓名、通讯地址、手机号码）；</p>
        <p>● 订购信息（如，(i) 订购人和收货人名称、送货地址、电邮地址和电话号码等与订购相关的任何信息；</p>
        <p>● 指示我们将商品或服务提供给其他人士时提供的该人士的有关信息（如，该人士的姓名、送货地址、电邮地址和电话号码）；</p>
        <p>● 支付信息（如，订单支付详情）和财务信息（如，银行账号）；</p>
        <p>我们可能会就下列各种情况，获得您的用户信息：</p>
        <p>● 您在访问或使用本APP服务时提供的信息；</p>
        <p>● 您在与我们的沟通中自动获取的信息：无论您何时与我们沟通，我们接收并储存的信息；</p>
        <p>● 从其他来源获取的信息：如您参加我们或我们与合作伙伴组织的任何活动。</p>
        <p>顾客信息的使用</p>
        <p>我们可能会利用我们获取的用户信息：</p>
        <p>● 向您提供所需要的产品或服务（如，定向采购、货物配送）；</p>
        <p>● 处理和收取款项；</p>
        <p>● 就您的要求向您提供咨询服务，或向您做出回应或与您沟通；</p>
        <p>● 向您提供我们认为您可能会感兴趣的产品或服务；</p>
        <p>● 为提升我们的服务，联系您进行调研；</p>
        <p>● 进行数据分析（如，购买行为或趋势分析、市场或顾客调查、财务分析）；</p>
        <p>● 管理或认可您参加各种活动的资格，如线上或线下活动、优惠或促销活动；</p>
        <p>● 在事先获得您同意的情况下，向您指定的联系人发送信息；</p>
        <p>● 防止各种违法或犯罪活动和其他法律责任；</p>
        <p>● 遵守法律规定和我们的政策规则。</p>
        <p>在下列情况下，我们可能还会披露您的相关信息：</p>
        <p>● 根据法律、法规或法律程序（如，法院法令或传召出庭令）的规定；</p>
        <p>● 根据政府部门（如，行政机构、执法机构）的要求；</p>
        <p>
            <span><b>《隐私声明》的更新</b></span>
        </p>
        <p>
            &nbsp;&nbsp;&nbsp;&nbsp;在中国法律允许的范围内，我们可能会不时更新本《隐私声明》，恕不提前通知。我们将在本网站上醒目位置发布公告，告知您我们《隐私声明》的任何重大变动
        </p>
    </view>
</template>

<script>
export default {
    data() {
        return {};
    },
    methods: {}
};
</script>

<style>
    .container{
        font-size:28upx ;
        margin: auto 30upx;
    }
</style>
